#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "b7308d98182571da8b70656e0c2673d9" -> "6a867246a306ca0db816afc0e688d4df"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4e6fac809ea28493c2622723d7bff66d" -> "1e470adbbdea543acd3698f5f24aa7ee"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "08c50f477a806a24267c853bf78805d5" -> "72fdf55a5e747f7057abd78eda65a424"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "e8cedad381af154b1a5c74d1d0112243" -> "220b27e7d35d23730658a72ad509e33d"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "3bbd55db1e6ba4bd16f4b9aa15701149" -> "6da526bb74355a506f5aa22f34d91722"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "aa3db18417da16031b3d286d082fd00c" -> "9fdd86b3e7016e6db8da3257115d4671"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "aa361f11cb99efc7bbfe71eb07b94d1d" -> "41225fff7d9d64744c39f2ca8c48eab6"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "8a427770bb13c569e9263cb4cfb561c0" -> "1c27caa5c211530f54062ff18499e134"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "c746c8ba371bcd284817e8c555e23e2f" -> "3c3bbc3306fa13833c48d0be2fc166a0"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "2111723bf19c0a9b0a2af829ca5b46dd" -> "fcfcf2299d44501eff7925983890e531"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "ec14616d9f7c8878474b7a6f325c4fce" -> "23d3e335fa4ae29d2a04522e6b4f83b1"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "f689e89f9ebc884e7bc207da284cf14b" -> "7b1b6d693390941d96b9cd9ff36463a0"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "34d91ef0e618820b7e811d01239a611f" -> "97b67cdaf605008bbdb28c4c5507cbc7"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "3cfbd69a828fb2d2354eed51af28ed28" -> "04b4762dac42b8979dec75a5d58eb09f"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "6e878663eecc94758e718e080583a199" -> "6edced6ca06d19e568dbd01287e1df9b"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "005857587cfbea061e206d830013dd5b" -> "a5d2947561103f8c15844e3d498a54d3"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "ff8d0d8361db5be960cbc7bb79789039" -> "26605e179d2d406a47051de283a2cb58"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "fabe9ba8dcc44229ace9325978bffef9" -> "bea909ef69657ea55dc9e85fb26db9e0"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "187c4f386d6ef74c49b9da65c49efc63" -> "8304e4bdc33910df0ee75935458bce93"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8f9f3e0fdf603b6cc3ce7b0ef1bf5c47" -> "1ead143686951ca6f12daa5c80104add"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "a5f82f1dd1c4b3db5985c630281e3c8c" -> "7741ce1f3bcf72742b26462b20f3d3ef"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "8f23c53661bcaba33bab3909098a98db" -> "b7c35031ab92e27586edec3fb83dbee5"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e2f1b0e8aa95cb1a7f3d373255f2e3d7" -> "e7bfdd925188aac35be4a65b47d49b10"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "c4f76b068684a5776e759452fa9b9399" -> "aa5d0f4894a911fffe02aa63c658975a"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "f22c2b8680800cf000b722a3dcb9aeaa" -> "9ab06ded156684332de8fd9d0060ab9d"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "bb3d3d96bf8631dcaf2388f642c4f997" -> "546000e031dec60afb4bdb4a2de37d69"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "dbb5b2b82e0aa6a2e02c30bf846fcc59" -> "2d3292ed9edf0b240580b6d2860e554a"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "562e3d8094cd36caa0524d193ccdef1b" -> "2a187c32699026b080a94a3076aba969"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "99c41939f42577092e6fa2e79c4b7b14" -> "17fd8992846678c6b3d57763dec3a54d"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "eb55c653a29e22d8b10885eb5b4e41fd" -> "8902a2a6925fcec688fff9de61c4feae"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "e2d0cab8ba0fb9daa70bb282db5cbd9c" -> "f18b11f46fd32dd19ff3beb1ea5b1e37"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "941f448a1a07348d61d488b47b8a9430" -> "53162cc6e1780e605d1d435c44a481e0"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "34582faa67fbec523d387e1db0533be3" -> "7ee4d6e24d808feeb8a0690efad98011"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "9ea20a186250a37199da9eb302aa4a08" -> "08b25865614ea619d24cd1a5a5f5b211"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "51a723cfd6753ef365118af65500a602" -> "f33157226055be127b1a84a747d56f10"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b163ea808d1c57db46c2dfc5cabf6423" -> "aac289b9a8e5f549b081f2d97f1fb712"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "2aad33af9667ac860effc2c87f5a2fce" -> "2ed5e08784f670de4d86938f6ca6db23"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "1063e1fca3ab791636db25c44c63a547" -> "57c418f5bfedea2023587e1123f0b8ac"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "19cd4a2b50f8ff175ce0e32d29e9d099" -> "01c7e7b97b7b294416911c683d16a038"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "eca7d0e047544df245cd13930e65654f" -> "fe4dad4147302128ebcaf1014003c027"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "f3d9dc32b685bd00a64fa06f7e8275c2" -> "06be353fb52b1495a112c7f269d6b167"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "e64ab5e96ee7db3fa886b1df79a933d7" -> "1f0dcc454af240aa25d277db6fa388ad"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4101f8d9de61b39a50a6941eac6c01fa" -> "11f3add3797b6d0bf9eb751e9efda0c9"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "TYWCGuVvrc9sqeVdOChAusj+QxvtjYmPUFevTe1r+Z0=" -> "IynBxeLVCSvLn9BWlK9lfSxqXPde64sesIglmmbN4dk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "mc9UOvXW1ZBVwrqJbEZzJW68TMxqT3IxAQWjuocCQvk=" -> "hOp+lgIgh4Cv1GiGHWfXr9HG3cRtaDjZNVCKZL59oy4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "CszAxaBqgscVqFK/MU0X/0WiMzCvwY7SYnooYo8/cVc=" -> "G1xWWun2c4Ngb6lmxuDAj75MdXPbAuORfUQguK4LZZg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "D+G6qptMpjfOUN1e9HgFIQHmjjtQtPNl0L2nwBBgfu8=" -> "Xjx8ap/72SL1WdP3S/qSYs+v2RhMKj4Vt7EabKttMZ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "XBVgUq/niQR6pfIabAfA6CZV553aZ5wjUtlBuIpjWQ8=" -> "W9eTKef44A70IrcCpmU5LPzjNxWvdhGJLWIFFGsFDa8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "L+cILwiEQXoq/5yaDS0rHP3V3yIhAinSuQwRtQbcepE=" -> "o5ZgZ3JwQYpNvh82CLs4DyRX8DeZcxtdZZnvZofpAa4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "EWcOBLjFKoYylkKcfdbjoIOZsFW4zQseoCK17eIwaS8=" -> "k2WbBYVzdyDfrdJNySqLqQidtKPkPtjHX4z5aq+ZWUo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "HINmKrNiME0UOU3QL1ATsJRR0tryDtD9x5mYa9imzyo=" -> "QBr9vX3pJz6/ojcLGqwdCZlgfMW9yt6KEL1tPGjeaQs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "9UTwXjsv1o8c8qaRfs8wcnbK+rLy3k6HvJREANU4ZHM=" -> "DHeJV9NqkMf6rlzMmeIf9m4RAI8H4h5YMeoqdH9pI4Q="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "KwTdB7tMJxc4ZTXITX6s58fAdbmImMKFL5wVHwjwSyE=" -> "Jl2Xh0l5ySA0IcoY7kIGuk70sXZ0qit5cVXNFS6C8kE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "4H0OIV43+tstOK3KaiDU7mBn8lScyQy7qs5ogDHgd/w=" -> "2ul/1qtY4ottHWOqa+3oqXeZSofRc6z43+nhKEBYCEQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "or8bQsNcJycksUPl9sDL+DOFMUDaXaOXjAGtpe03Xrk=" -> "gmKYloVHqTTnZ5TGePrdXA7SDVDjjvztbx5Abn035a4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "s9gs3SCif51Eqh0ql/3yEfUjDUaUHAjirtaQf2mHdV4=" -> "XFEJ5JalsVQswk1rSmGnh2LamcDk4mkVMAkJPnljr38="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vpG8boMfnKj3hpS5myj9H7+qrr5oIGMhZYsWOon4PQ4=" -> "/X6FQTMcYyX6wc90f99XGm8Ut7J6TlVXOJ/JvZOuAhs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "dNZVbdMhx5hIg9F1QB2yItHVJBgeMDbaK0rs0EV46pY=" -> "KldjKyKnfC+x4SzgJ6DepZ829akgOLeIGXncIZQ9ahs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "M41+EbPf+llD/JCR6XfWoxnBWhrHuJQKEEOkKc2FtmE=" -> "QE4Jza3cW9clprlr4IneCcxnPy4G9TfitXDVjRwTCqQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y084Cvs1zvpCVnLrjSQZw2/jWaJsHi9t8+UIvn+CSZ4=" -> "YvVSaSJ8Q+6WLfnllfV7WIOB+aklAVZ5pew+Kwstl7k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bz+PijrGOcUy7Zk2aH9+XUXOLT4e+byeiBMPr3YluOM=" -> "WQ76Djco3skRov1gIb1cXwiCXjDaAsaCEtLXdUPOfh8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "7GqROsvbBG4mUfeRsIzWWRd3hGpJvSV6PrsiQhMYQIY=" -> "w7r8cgr1RKFgoRZZVD+M/Po9jZPMEc9odoRuTe2vf5M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "wdDOVhqYMhXANS+jUYbxz+ZaXC74g1VbnNXQSHWcuAI=" -> "80Kqaj/KrW5Rhld2gZRP5JNpFPkK002SymZ1GdAy0f4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "AUejKNI2/ihuurNJLpE49SAdgspl/5HBOfUcR8g8Q3o=" -> "fURodYLhzczha9MDUr0vq17RoLCQ/RuGAY6X3Yi4Tsw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "eWQC+eBHBpaz8F5/GcsAWgyW5dwJx67FhC7sEcJDGpA=" -> "5J4MC3RriJ3Hb1B+foDOIqBUaXDUMKAloG/iXBa0FXM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "2DZH6P4M8RDrWw4kylp8hPfQa9vsjoMlPgJoGBYdsq0=" -> "mEktp0U36+g/gbYU2BuNeN2GidqzW6iYUbu4wUZiaZc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "ewejkk0K+uWbtHCxMcaVJh0GerjXvuR2jaU+8NBsHBI=" -> "GNo2Io7Zmv7HW/ddx3MESX3KT3xM6FEIF+yKAW8+nmw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "yS/mjcGm68bYBSMCAX02dEJ08HC8H29mP7VjiyDJhVk=" -> "ZYeuwVujOgXY/hEEWJgY3s6NgMdHGYXuHJP+EyUlELM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-07T14:44:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "e0WtX04/HPlS36ARsjFVgxOhKu8EeBRlDQKYuw/BcTg=" -> "qjfw9BjOSNw52EJq1v4U4Yy8czofK5VRnd6koiamtUk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSvkpsJGnH81xgzfEJxj9tqtwr9UagwenB2qrKyIx0Y=" -> "3P6UGrOY1nHiYOsOTJ3ttWCmwOMKMNJ9ao7w+gm1EYk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "XUJeCWPsfBKEqf6y3qeIn8haVkVFRO0lo5VOw6MPX+0=" -> "qcg5pf+gnmoNTuFSFSZu5WnscCa3Xaf+sY1OnBXFe0Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "+hr8DxnHrFcMEihRXNHLrjshMdwAlJBe2fVbc+sgD7U=" -> "uH9E/SJoV12sVZAUbuK5G6OEbGjZQKoJQRIdElPQVA8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "6lK8m224JHD8AGzeWxIdxOb0UyYoK7ThFUz45d0yPWs=" -> "iq4wkPA495o8ZjVxoqV9jeCO/qjE3n5sGj3C38licO4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "X8zdqdpRUFYe2DO4DDuvWRHCjtu0RAPmKiS/Bls89NA=" -> "+NQ0umRDn+Pun4dng7em//QYOfut7JQH0uyoh5udnq8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "jjMZb1tMUaa+Zp9iDqa5QbhnNVR+/0kPXVtvtKuMtUM=" -> "2JF+aAn8RyHCIs0xe0SQy5++b4m3vmr2FPUrueUC/5I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGDfxPGdprvspnOj0ZiTszGVGAGam8c6i1Bt7c5QLPE=" -> "d0tttSN9zNEbk9MCWa5GCFLt1Uc1GmKxBm3fH18iwzc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "FRzvrRAtklzGaf4Fa6QgxoP2TFLKGdwFn4FvGnHdMfs=" -> "/1ckdj8DV2fEsQoiw10/53Fc10D+ubPatjnmy8hl1QY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "BJsKb9DYy8pQhVQ6N9Jhxz0dVX8t1H76H68/ynX3iwA=" -> "hZEeIovbhQCJ+pCsjuxlPgz6bkfyqAs4zUMLOsWEu5c="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "N3jLlKml6pQKreHUTX0kUvOcHM92/5cHg+piwUWRm2g=" -> "jZFYpJKNaF03cgwvPwAReaxT1AvXOEW/OUaAPSJMCFI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "1A1KL29Y5Qzewl4V84ogs+EB9NvsE8LNi7ruDKukMj4=" -> "EnQWe2YMrTeWjLMh5dDYJ4t3nlRcMgka8W4qtzi7g3k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "LdUdrQFvnTR2cuP++BN9bHwdOPcwaGdVBhV8pjdPyVI=" -> "FtupSeKdESprcNW9eFcAnTXwuY/CAOpxccLn49a8j6s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr56d2uiEuo53jo3z6Lgh8AhikL6O+QtmUU/CfbaJq0=" -> "6+ZcCeLXBHvhPBCbwt21owI5LeyNsXj14k6Mx+gD7TY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "TPzqoMXa0sZ+u3gDXbgyY1z5rRh4GSZP8BVxgIdVDM8=" -> "pH9yQeXItVqLe6DZ5jG7pI4P2nQjqzYM7SIz0LlMGow="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "u7TFVOp95/vzpVOjVejVeNjzwgTlwDCQ8sm+bUOeKkE=" -> "dGoSz+HXbhNRQ9tQvWyViV8CC6bdxVuhgRqezwIouVU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "63ibKCKtJJMQRXc/UMO4OPG9SRV+/7WMlYuzQg/nrZE=" -> "PnINjwdyXyir2S1fCA6wTZLUAWy1+1WFl5SOb1JuOb8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-07T14:10:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "z3eha4" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-07T14:10:34Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-07T14:10:33Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 87 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*